'''
dict_travel_info = {
    "北京": {
        "景区": ["长城", "故宫"],
        "美食": ["烤鸭", "豆汁焦圈", "炸酱面"]
    },
    "四川": {
        "景区": ["九寨沟", "峨眉山"],
        "美食": ["火锅", "兔头"]
    }
}
1. 打印北京的第一个景区
效果：
长城
2. 打印四川的第二个美食
效果：
兔头
3. 所有城市 (一行一个)
效果：
北京
四川
4. 北京所有美食(一行一个)
效果：
烤鸭
豆汁焦圈
炸酱面
5. 打印所有城市的所有美食(一行一个)
效果：
烤鸭
豆汁焦圈
 炸酱面
 火锅
 兔头
'''

dict_travel_info = {
    "北京": {
        "景区": ["长城", "故宫"],
        "美食": ["烤鸭", "豆汁焦圈", "炸酱面"]
    },
    "四川": {
        "景区": ["九寨沟", "峨眉山"],
        "美食": ["火锅", "兔头"]
    }
}

# print(dict_travel_info['北京']['景区'][0])
# print(dict_travel_info['四川']['美食'][1])

# for x in dict_travel_info:
#     print(x)

# for x in dict_travel_info["北京"]["美食"]:
#     print(x)

for x in dict_travel_info.values():
    for y in x["美食"]:
        print(y)